<a href="https://colab.research.google.com/github/mochosan/google-colab-test/blob/master/titanic_var1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [256]:
from google.colab import files
import pandas as pd

#read data
uploaded_data = files.upload()

Saving train.csv to train (5).csv

In [14]:
uploaded_test_data = files.upload()

Saving test.csv to test (4).csv

In [0]:
pd.set_option('display.max_rows', 1000)

In [0]:
#read csv files
train_data = pd.read_csv('train.csv')

In [236]:
train_data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [237]:
test_data = pd.read_csv('test.csv')
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# 特徴量の数値化
  - Name:不要
  - Sex:male¬0,female¬1
  - cabin:一旦削除（後に使うかも）
  - embarked:一旦削除（〃）
  - Survived:削除
  - Ticket:削除
  - Fare:del
  - Embarked:del

In [238]:
#欠損値の確認
x_train = train_data

x_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [239]:
#欠損値処理
print(x_train["Age"].mode()[0])
x_train = x_train.fillna(x_train["Age"].mode()[0])
x_train.head(10)

24.0

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,24,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,24,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,24,S
5,6,0,3,"Moran, Mr. James",male,24.0,0,0,330877,8.4583,24,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,24,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,24,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,24,C

In [240]:
#学習データ の性別のラベル化
#men:0, female: 1
x_train_sex_labels, uniques = pd.factorize(x_train['Sex'])
print(uniques)
x_train['Sex'] = x_train_sex_labels
print(len(x_train))
x_train.head()

Index(['male', 'female'], dtype='object')
891

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,24,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,24,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,24,S

In [0]:
#欠損値処理 for train data
x_train = x_train.drop('Name', axis=1)
x_train = x_train.drop('Cabin', axis=1)
x_train = x_train.drop('Embarked', axis=1)
x_train = x_train.drop("Ticket", axis=1)

In [242]:
#正解ラベルの取り出し
y_train = x_train.Survived
x_train = x_train.drop("Survived", axis=1)
x_train.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare
0            1       3    0  22.0      1      0   7.2500
1            2       1    1  38.0      1      0  71.2833
2            3       3    1  26.0      0      0   7.9250
3            4       1    1  35.0      1      0  53.1000
4            5       3    0  35.0      0      0   8.0500

In [243]:
#テストデータの形成
x_test = test_data
x_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [244]:
#テストデータの欠損値処理
x_test["Age"] = x_test["Age"].fillna(x_train["Age"].mode()[0])
x_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [245]:
#テストデータの性別のラベル化
x_test_label = uniques.get_indexer(x_test['Sex'])
x_test['Sex']  = x_test_label
x_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S

In [0]:
#テストデータの形成
x_test = x_test.drop("Name", axis=1)
x_test = x_test.drop("Ticket", axis=1)
x_test = x_test.drop("Cabin", axis=1)
x_test = x_test.drop("Embarked", axis=1)

In [247]:
#exec training
import xgboost as xgb
print(len(x_train), len(y_train))
clf = xgb.XGBClassifier()

clf.fit(x_train, y_train)

891 891

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
       colsample_bytree=1, gamma=0, learning_rate=0.1, max_delta_step=0,
       max_depth=3, min_child_weight=1, missing=None, n_estimators=100,
       n_jobs=1, nthread=None, objective='binary:logistic', random_state=0,
       reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
       silent=True, subsample=1)

In [251]:
#exec test

y_pred = clf.predict(x_test)
print(y_pred)
print(len(y_pred))

[0 0 0 0 0 0 0 0 1 0 0 0 1 0 1 1 0 0 0 0 0 0 1 1 1 0 1 0 1 0 0 0 0 0 1 0 0
 0 0 0 0 0 0 1 1 0 0 0 1 1 1 0 1 1 0 0 0 0 0 1 0 0 0 1 0 1 1 0 1 1 1 0 0 0
 1 1 0 1 0 1 1 0 0 0 0 0 1 0 1 1 0 0 1 0 0 0 1 0 1 0 1 0 0 0 0 0 0 0 0 0 0
 1 1 1 1 0 0 1 1 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0
 0 0 1 0 0 0 0 0 1 1 0 0 1 1 1 0 0 0 0 0 1 0 0 0 0 0 0 1 1 0 1 1 0 1 1 0 1
 0 1 0 0 0 0 0 0 0 1 0 1 1 0 0 0 1 0 1 0 0 0 0 1 0 0 0 0 1 0 0 1 0 1 0 1 0
 1 0 1 0 0 1 0 0 0 1 0 0 1 0 0 0 1 1 1 1 0 0 0 0 1 0 1 0 1 0 0 0 0 0 0 0 1
 0 0 0 1 1 0 0 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0
 1 0 0 0 0 0 0 0 1 1 0 1 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 1 0 1 0 0 0 1 0 0
 1 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 1 1 0 0 0 1 0 1 0 0 0 0 1 1 0 1 0 0 0 1 0
 0 1 0 0 1 1 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 1 0 0 0 1 0 1 0 0 1 0 1 0 0 0 0
 0 1 1 1 1 1 0 1 0 0 0]
418

In [265]:
pwd

'/content'

In [0]:
#提出データの作成
sub = pd.DataFrame(pd.read_csv("test (1).csv")['PassengerId'])
sub['Survived'] = list(map(int, y_pred))
sub.to_csv("submission.csv", index = False)

In [257]:
ll

total 508
drwxr-xr-x 1 root  4096 May  8 16:22  sample_data/
-rw-r--r-- 1 root  3239 May 13 08:12  submission.csv
-rw-r--r-- 1 root 28629 May 13 07:02 'test (1).csv'
-rw-r--r-- 1 root 28629 May 13 07:03 'test (2).csv'
-rw-r--r-- 1 root 28629 May 13 07:04 'test (3).csv'
-rw-r--r-- 1 root 28629 May 13 07:06 'test (4).csv'
-rw-r--r-- 1 root 28629 May 13 05:31  test.csv
-rw-r--r-- 1 root 61194 May 13 07:02 'train (1).csv'
-rw-r--r-- 1 root 61194 May 13 07:03 'train (2).csv'
-rw-r--r-- 1 root 61194 May 13 07:04 'train (3).csv'
-rw-r--r-- 1 root 61194 May 13 07:06 'train (4).csv'
-rw-r--r-- 1 root 61194 May 13 08:16 'train (5).csv'
-rw-r--r-- 1 root 61194 May 13 05:31  train.csv

In [258]:
pwd

'/content'

In [0]:
#提出ファイルのダウンロード
files.download('submission.csv')